УРВ_файловая/src/InformationRegisters/ПользователиПриложений/ПользователиПриложений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПользователиПриложений</name>
  <resources>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.Сервисы</types>
    </type>
  </resources>
  <resources>
    <name>Разрешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Приложение</name>
    <type>
      <types>CatalogRef.Приложения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПользовательСервиса</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Право</name>
    <type>
      <types>EnumRef.ПраваПользователейПриложений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/InformationRegisters/СведенияОПользователях/СведенияОПользователях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОПользователях</name>
  <resources>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </resources>
  <resources>
    <name>ПотребоватьСменуПароляПриВходе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияНеОграничен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПросрочкаРаботыВПрограммеДоЗапрещенияВхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРазрешенияВходаВПрограмму</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаАвтоматическогоЗапрещенияВхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаИспользованияПароля</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользованныеПароли</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ПоследнийИспользуемыйКлиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/Enums/СостоянияОбращений/СостоянияОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОбращений</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>Расследование</name>
  </enumValues>
  <enumValues>
    <name>Исправление</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеИнициатора</name>
  </enumValues>
  <enumValues>
    <name>Закрыто</name>
  </enumValues>
</mdclass:Enum>

УРВ_файловая/src/Documents/Обращение/Обращение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Обращение</name>
  <registerRecords>AccumulationRegister.ЗначенияПоказателей</registerRecords>
  <registerRecords>InformationRegister.ГолосаПользователейЗаПожелания</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияОбращений</registerRecords>
  <attributes>
    <name>Абонент</name>
    <type>
      <types>CatalogRef.Абоненты</types>
    </type>
  </attributes>
  <attributes>
    <name>АбонентОбслуживающейОрганизации</name>
    <type>
      <types>CatalogRef.Абоненты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДляПереписки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажности</types>
    </type>
  </attributes>
  <attributes>
    <name>Витрина</name>
    <type>
      <types>CatalogRef.Витрины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОценки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.КаналыПолученияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>КарточкаБазыЗнаний</name>
    <type>
      <types>CatalogRef.Пожелания</types>
      <types>CatalogRef.Консультации</types>
      <types>CatalogRef.Ошибки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компонент</name>
    <type>
      <types>CatalogRef.КомпонентыСервиса</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоПрикрепилКарточку</name>
    <comment>Пользователь, который прикрепил к обращению карточку базы знаний</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСокращенный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжиданиеОценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодпискаНаТариф</name>
    <type>
      <types>DocumentRef.Подписка</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученНовыйОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.Разделы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.Сервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>EnumRef.ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроекта</name>
    <type>
      <types>CatalogRef.ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннееОбращение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетСвязьСВнутренними</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетСвязьСВнешними</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОбращенияКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутренняяПереписка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛинияПоддержки</name>
      <type>
        <types>CatalogRef.ЛинииПоддержки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполненПеренос</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнешниеОбращения</name>
    <attributes>
      <name>Обращение</name>
      <type>
        <types>DocumentRef.Обращение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УРВ_файловая/src/CommonModules/Обслуживание/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает значение абонента обслуживающей организации абонента.
// Параметры:
//	Абонент - СправочникСсылка.Абоненты - абонент, для которого нужно вернуть абонента ОО.
//
Функция АбонентОбслуживающейОрганизацииАбонента(Абонент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаимоотношенияАбонентовСрезПоследних.ВедущийАбонент
		|ИЗ
		|	РегистрСведений.ВзаимоотношенияАбонентов.СрезПоследних КАК ВзаимоотношенияАбонентовСрезПоследних
		|ГДЕ
		|	ВзаимоотношенияАбонентовСрезПоследних.Абонент = &Абонент
		|	И ВзаимоотношенияАбонентовСрезПоследних.ВидВзаимоотношений = &ОбслуживающаяОрганизацияАбонент";
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("ОбслуживающаяОрганизацияАбонент", Перечисления.ВидыВзаимоотношений.ОбслуживающаяОрганизацияАбонент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВедущийАбонент;
	Иначе 
		Возврат Справочники.Абоненты.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции 

// Возвращает значение абонента по пользователю сервиса.
// Параметры:
//	ПользовательСервиса - СправочникСсылка.ПользователиСервиса
//
Функция АбонентПользователяСервиса(ПользовательСервиса) Экспорт
	
	Запрос = Новый Запрос;
    
    Запрос.Текст = 
    "ВЫБРАТЬ РАЗЛИЧНЫЕ
        |   ПользователиПриложений.Приложение.Абонент КАК АбонентПользователя
        |ИЗ
        |   РегистрСведений.ПользователиПриложений КАК ПользователиПриложений
        |ГДЕ
        |   ПользователиПриложений.ПользовательСервиса = &ПользовательСервиса
        |   И ПользователиПриложений.Разрешено";
    Запрос.УстановитьПараметр("ПользовательСервиса", ПользовательСервиса);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Количество() = 1 Тогда
        Выборка.Следующий();
        Возврат Выборка.АбонентПользователя;
    ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьТарифы") Тогда
        Пока Выборка.Следующий() Цикл
            Если Документы.Подписка.АктивнаяПодпискаАбонента(Выборка.АбонентПользователя) <> Неопределено Тогда
                Возврат Выборка.АбонентПользователя;
            КонецЕсли;
        КонецЦикла;
	КонецЕсли; 
    
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПользователиАбонентов.Абонент КАК АбонентПользователя
		|ИЗ
		|	РегистрСведений.ПользователиАбонентов КАК ПользователиАбонентов
		|ГДЕ
		|	ПользователиАбонентов.ПользовательСервиса = &ПользовательСервиса";
		
	Запрос.УстановитьПараметр("ПользовательСервиса", ПользовательСервиса);
	
	Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Количество() = 1 Тогда
        Выборка.Следующий();
        Возврат Выборка.АбонентПользователя;
    ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьТарифы") Тогда
        Пока Выборка.Следующий() Цикл
            Если Документы.Подписка.АктивнаяПодпискаАбонента(Выборка.АбонентПользователя) <> Неопределено Тогда
                Возврат Выборка.АбонентПользователя;
            КонецЕсли;
        КонецЦикла;
    КонецЕсли; 
    
    Возврат Справочники.Абоненты.ПустаяСсылка();

КонецФункции

// Возвращает массив абонентов пользователя сервиса.
//
Функция АбонентыПользователяСервиса(ПользовательСервиса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПользователиАбонентов.Абонент КАК АбонентПользователя
		|ИЗ
		|	РегистрСведений.ПользователиАбонентов КАК ПользователиАбонентов
		|ГДЕ
		|	ПользователиАбонентов.ПользовательСервиса = &ПользовательСервиса";
		
	Запрос.УстановитьПараметр("ПользовательСервиса", ПользовательСервиса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	АбонентыПользователя = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		АбонентыПользователя.Добавить(Выборка.АбонентПользователя);
	КонецЦикла; 
	
	Возврат АбонентыПользователя;
	
КонецФункции
	
// Генерирует сложный пароль
//
Функция НовыйПароль() Экспорт
	
	ЗаглавныеБуквы = "QWERTYUOPASDFGHJKLZXCVBNM"; // Без буквы I
	СтрочныеБуквы = "qwertyuiopasdfghjkzxcvbnm"; // Без буквы l
	Цифры = "1234567890";
	СпецСимволы = "_.,!?";
	
	Пароль = "";
	
	Генератор = Новый ГенераторСлучайныхЧисел;
	
	Пока СтрДлина(Пароль) < 8 Цикл
		
		Число = Генератор.СлучайноеЧисло(1, 6);
		
		Если Число = 1 Или Число = 2 Тогда
			
			Индекс = Генератор.СлучайноеЧисло(1, СтрДлина(ЗаглавныеБуквы));
			Пароль = Пароль + Сред(ЗаглавныеБуквы, Индекс, 1);
			
		ИначеЕсли Число = 3 Или Число = 4 Тогда
			
			Индекс = Генератор.СлучайноеЧисло(1, СтрДлина(СтрочныеБуквы));
			Пароль = Пароль + Сред(СтрочныеБуквы, Индекс, 1);
			
		ИначеЕсли Число = 5 Тогда
			
			Индекс = Генератор.СлучайноеЧисло(1, СтрДлина(Цифры));
			Пароль = Пароль + Сред(Цифры, Индекс, 1);
			
		Иначе
			
			Индекс = Генератор.СлучайноеЧисло(1, СтрДлина(СпецСимволы));
			Пароль = Пароль + Сред(СпецСимволы, Индекс, 1);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Пароль;
	
КонецФункции

// Процедура - Принять объекты в работу
//
// Параметры:
//  Ссылки - Массив - ссылки на объекты типа СправочникСсылка.Консультации, СправочникСсылка.Ошибки, 
//                    СправочникСсылка.Пожелания, ДокументСсылка.Обращение, ЗадачаСсылка.ЗадачаИсполнителя 
//
Процедура ПринятьОбъектыВРаботу(Ссылки, Знач Список = Неопределено) Экспорт
    
    Если Ссылки.Количество() = 0 Тогда
        Возврат;
    КонецЕсли; 
    
    Если ТипЗнч(Ссылки[0]) = Тип("СправочникСсылка.Консультации") Тогда
        ПринятьОбъектыБазыЗнанийВРаботу(Ссылки, Справочники.Консультации);
    ИначеЕсли ТипЗнч(Ссылки[0]) = Тип("СправочникСсылка.Ошибки") Тогда
        ПринятьОбъектыБазыЗнанийВРаботу(Ссылки, Справочники.Ошибки);
    ИначеЕсли ТипЗнч(Ссылки[0]) = Тип("СправочникСсылка.Пожелания") Тогда
        ПринятьОбъектыБазыЗнанийВРаботу(Ссылки, Справочники.Пожелания);
    ИначеЕсли ТипЗнч(Ссылки[0]) = Тип("ДокументСсылка.Обращение") Тогда  
        ПринятьОбращенияВРаботу(Ссылки);
    ИначеЕсли ТипЗнч(Ссылки[0]) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
      	БизнесПроцессыИЗадачиВызовСервера.ПринятьЗадачиКИсполнению(Ссылки);
    Иначе
        ВызватьИсключение НСтр("ru='Не поддерживаемый объект перенаправления.'");
    КонецЕсли;
    
    Если Ссылки.Количество() > 0 И Список <> Неопределено Тогда
        Список.Обновить();
    КонецЕсли; 
    
КонецПроцедуры

// Процедура - Перевести объекты на линию
//
// Параметры:
//  Ссылки - Массив - ссылки на объекты типа СправочникСсылка.Консультации, СправочникСсылка.Ошибки, 
//                    СправочникСсылка.Пожелания, ДокументСсылка.Обращение 
//
Процедура ПеревестиОбъектыНаЛинию(Ссылки, Список = Неопределено) Экспорт
    
    Если Ссылки.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;
    
    Если ТипЗнч(Ссылки[0]) = Тип("СправочникСсылка.Консультации") Тогда
        ПеревестиОбъектыБазыЗнанийНаЛинию(Ссылки, Справочники.Консультации);
    ИначеЕсли ТипЗнч(Ссылки[0]) = Тип("СправочникСсылка.Ошибки") Тогда
        ПеревестиОбъектыБазыЗнанийНаЛинию(Ссылки, Справочники.Ошибки);
    ИначеЕсли ТипЗнч(Ссылки[0]) = Тип("СправочникСсылка.Пожелания") Тогда
        ПеревестиОбъектыБазыЗнанийНаЛинию(Ссылки, Справочники.Пожелания);
    ИначеЕсли ТипЗнч(Ссылки[0]) = Тип("ДокументСсылка.Обращение") Тогда  
        ПеревестиОбращенияНаЛинию(Ссылки);
    Иначе
        ВызватьИсключение НСтр("ru='Не поддерживаемый объект перенаправления.'");
    КонецЕсли;
    
    Если Ссылки.Количество() > 0 И Список <> Неопределено Тогда
        Список.Обновить();
    КонецЕсли; 
    
 КонецПроцедуры

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик регламентного задания РасчетДлительностиОбработкиАктивныхОбращений
//
Процедура РасчетДлительностиОбработкиАктивныхОбращений() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	РегистрыСведений.ДлительностьОбработкиОбращений.РассчитатьДлительностьОбработкиАктивныхОбращений();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ПринятьОбращенияВРаботу(Ссылки)
	
	НовыйСписокСсылок = Новый Массив();
	
	НачатьТранзакцию();
	
	Попытка
		Документы.Обращение.ЗаблокироватьОбъекты(Ссылки);
		ТекущийПользователь = Пользователи.АвторизованныйПользователь();
		Сведения = РегистрыСведений.СведенияОПользователях.СведенияОПользователе();
		Для каждого Ссылка Из Ссылки Цикл
			Если ТипЗнч(Ссылка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда 
				Продолжить;
			КонецЕсли;
			Объект = Ссылка.ПолучитьОбъект();
			Если Не Объект.ПроверитьЗаполнение() Тогда
				Продолжить;
			КонецЕсли;
			Объект.Заблокировать();
			Объект.ОбслуживающаяОрганизация = Сведения.ОбслуживающаяОрганизация;
			Объект.ЛинияПоддержки = Сведения.ЛинияПоддержки;
			Если Объект.Состояние = Перечисления.СостоянияОбращений.Новое Или Объект.Состояние = Перечисления.СостоянияОбращений.Закрыто Тогда
				Объект.Состояние = Перечисления.СостоянияОбращений.Расследование;
			КонецЕсли; 
			Объект.Исполнитель = ТекущийПользователь;
            Попытка
			    Объект.Записать(РежимЗаписиДокумента.Проведение);
                НовыйСписокСсылок.Добавить(Ссылка);
            Исключение
                // Если документ не записался, мы его пропускаем.
            КонецПопытки;    
		КонецЦикла;
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Ссылки = НовыйСписокСсылок;
	
КонецПроцедуры

Процедура ПеревестиОбращенияНаЛинию(Ссылки)
	
	НовыйМассивОбращений = Новый Массив();
	
	НачатьТранзакцию();
	
	Попытка
		Документы.Обращение.ЗаблокироватьОбъекты(Ссылки);
		
		ТекущийПользователь = Пользователи.АвторизованныйПользователь();
		СведенияОПользователе = РегистрыСведений.СведенияОПользователях.СведенияОПользователе();
		
		Для каждого Ссылка Из Ссылки Цикл
			
			Если ТипЗнч(Ссылка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда 
				Продолжить;
			КонецЕсли;
			
			ОбращениеОбъект = Ссылка.ПолучитьОбъект();
			Если Не ОбращениеОбъект.ПроверитьЗаполнение() Тогда
				Продолжить;
			КонецЕсли;
			
			Если ОбращениеОбъект.Исполнитель = ТекущийПользователь Тогда
				ОбращениеОбъект.Заблокировать();
				ОбращениеОбъект.ОбслуживающаяОрганизация = СведенияОПользователе.ОбслуживающаяОрганизация;
				ОбращениеОбъект.ЛинияПоддержки = СведенияОПользователе.ЛинияПоддержки;
				ОбращениеОбъект.Исполнитель = СведенияОПользователе.ЛинияПоддержки;
				ОбращениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
				НовыйМассивОбращений.Добавить(Ссылка);
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Ссылки = НовыйМассивОбращений;
	
КонецПроцедуры

Процедура ПринятьОбъектыБазыЗнанийВРаботу(Ссылки, МенеджерОбъектов)
	
	ОбработанныеСсылки = Новый Массив();
	
	НачатьТранзакцию();
	
	Попытка
		МенеджерОбъектов.ЗаблокироватьОбъекты(Ссылки);
		СведенияОПользователе = РегистрыСведений.СведенияОПользователях.СведенияОПользователе();
		Для каждого Ссылка Из Ссылки Цикл
			Если ТипЗнч(Ссылка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда 
				Продолжить;
			КонецЕсли;
			Объект = Ссылка.ПолучитьОбъект();
			Если Не Объект.ПроверитьЗаполнение() Тогда
				Продолжить;
			КонецЕсли;
			Объект.Заблокировать();
			Объект.ОбслуживающаяОрганизация = СведенияОПользователе.ОбслуживающаяОрганизация;
			Объект.ЛинияПоддержки = СведенияОПользователе.ЛинияПоддержки;
			Объект.Ответственный = Пользователи.АвторизованныйПользователь();
			Объект.Записать();
			ОбработанныеСсылки.Добавить(Ссылка);
		КонецЦикла;
        
        ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Ссылки = ОбработанныеСсылки;
	
КонецПроцедуры

Процедура ПеревестиОбъектыБазыЗнанийНаЛинию(Ссылки, МенеджерОбъектов)
	
	ОбработанныеСсылки = Новый Массив();
	
	НачатьТранзакцию();
	
	Попытка
		МенеджерОбъектов.ЗаблокироватьОбъекты(Ссылки);
		
		ТекущийПользователь = Пользователи.АвторизованныйПользователь();
		СведенияОПользователе = РегистрыСведений.СведенияОПользователях.СведенияОПользователе();
		
		Для каждого Ссылка Из Ссылки Цикл
			
			Если ТипЗнч(Ссылка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда 
				Продолжить;
			КонецЕсли;
			
			Объект = Ссылка.ПолучитьОбъект();
			Если Не Объект.ПроверитьЗаполнение() Тогда
				Продолжить;
			КонецЕсли;
			
			Если Объект.Ответственный = ТекущийПользователь Тогда
				Объект.Заблокировать();
				Объект.ОбслуживающаяОрганизация = СведенияОПользователе.ОбслуживающаяОрганизация;
			    Объект.ЛинияПоддержки = СведенияОПользователе.ЛинияПоддержки;
				Объект.Ответственный = СведенияОПользователе.ЛинияПоддержки;
				Объект.Записать();
				ОбработанныеСсылки.Добавить(Ссылка);
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Ссылки = ОбработанныеСсылки;
	
КонецПроцедуры

Процедура ЗаполнитьЛинииПоддержкиКарточекБазыЗнаний_1_0_11_1(Параметры) Экспорт
    
    Запрос = Новый Запрос;
    
    Запрос.УстановитьПараметр("ПустаяЛиния", Справочники.ЛинииПоддержки.ПустаяСсылка());
    
    ТипыКарточек = СтрРазделить("Консультации,Ошибки,Пожелания", ",", Ложь);
    Для каждого ТипКарточки Из ТипыКарточек Цикл
        
        Запрос.Текст = 
        	"ВЫБРАТЬ
            |   Карточки.Ссылка,
            |   ЕСТЬNULL(СведенияОПользователях.ЛинияПоддержки, Карточки.Ответственный) КАК ЛинияПоддержки
            |ИЗ
            |   Справочник.Консультации КАК Карточки
            |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПользователях КАК СведенияОПользователях
            |       ПО Карточки.Ответственный = СведенияОПользователях.Пользователь
            |ГДЕ
            |   Карточки.ЛинияПоддержки = &ПустаяЛиния";
        
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "Консультации", ТипКарточки);	
        
    КонецЦикла; 
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        КарточкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
        КарточкаОбъект.ОбменДанными.Загрузка = Истина;
        КарточкаОбъект.ЛинияПоддержки = Выборка.ЛинияПоддержки;
        КарточкаОбъект.Записать();
    КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
